In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [7]:
df = sns.load_dataset('titanic')

# Data shape

In [5]:
df.shape

(891, 15)

# How data look like

In [6]:
# Sample is the good way for first view of data
df.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
177,0,1,female,50.00,0,0,28.7125,C,First,woman,False,C,Cherbourg,no,True
87,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
799,0,3,female,30.00,1,1,24.1500,S,Third,woman,False,NaN,Southampton,no,False
728,0,2,male,25.00,1,0,26.0000,S,Second,man,True,NaN,Southampton,no,False
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False

# Data Type of Col

In [8]:
# It will give you the information of data --->
# 1. what's the datatype of every cols
# 2. How many values present in that cols
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# Check null value

In [9]:
# It'll give you the info of null values in every data
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# How data look mathematically
It is applicable only for numerical cols

In [10]:
# Describe method gives you the mathematical view of data
# count --> Count of values present in col
# mean --> Mean value of col
# std --> Std. deviation of col
# min --> Minimum value of col
# max --> Maximum value of col
# 25%(25 percentile) --> e.g, age, 25% value of age col is less than or equal to 20
# 50%(50 percentile) --> e.g, age, 50% value of age col is less than or equal to 28
# 75%(75 percentile) --> e.g, age, 75% value of age col is less than or equal to 38

# percentile value helps us to understand the anomaly

df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# Check duplicate rows

In [11]:
# Duplicated rows in dataset
df.duplicated().sum()

107

# Check correlation between cols
It is applicable only for numerical cols

In [13]:
# Here o/p col Survived --> Our task is to find correlation of survived to every col
# How much one col is correlated with other. If o/p col is not much depend with any of the col then we can easily delete it.
# Range --> -1 to 1
# Negative value means invertially correlated
# +ve value means correlated. If +ve value is more that's mean strongly correlated
# Survived col is strongly -ve correlated with adult_male(-0.5) --> If adult_male is increases then survived decreases and if adult_male decreses then survived increases(Invertially correlation) 
# Survived is strongly correlated with fair(0.2)

df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [15]:
# Check correlation of survived col to another cols
df.corr()['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64